micropython/micropython/ports/stm32/pyb_i2c.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "py/mperrno.h"
#include "py/mphal.h"
#include "irq.h"
#include "pin.h"
#include "bufhelper.h"
#include "dma.h"
#include "i2c.h"

#if MICROPY_PY_PYB_LEGACY && MICROPY_HW_ENABLE_HW_I2C

/// \moduleref pyb
/// \class I2C - a two-wire serial protocol
///
/// I2C is a two-wire protocol for communicating between devices.  At the physical
/// level it consists of 2 wires: SCL and SDA, the clock and data lines respectively.
///
/// I2C objects are created attached to a specific bus.  They can be initialised
/// when created, or initialised later on:
///
///     from pyb import I2C
///
///     i2c = I2C(1)                         # create on bus 1
///     i2c = I2C(1, I2C.CONTROLLER)         # create and init as a controller
///     i2c.init(I2C.CONTROLLER, baudrate=20000) # init as a controller
///     i2c.init(I2C.PERIPHERAL, addr=0x42)  # init as a peripheral with given address
///     i2c.deinit()                         # turn off the I2C unit
///
/// Printing the i2c object gives you information about its configuration.
///
/// Basic methods for peripheral are send and recv:
///
///     i2c.send('abc')      # send 3 bytes
///     i2c.send(0x42)       # send a single byte, given by the number
///     data = i2c.recv(3)   # receive 3 bytes
///
/// To receive inplace, first create a bytearray:
///
///     data = bytearray(3)  # create a buffer
///     i2c.recv(data)       # receive 3 bytes, writing them into data
///
/// You can specify a timeout (in ms):
///
///     i2c.send(b'123', timeout=2000)   # timeout after 2 seconds
///
/// A controller must specify the recipient's address:
///
///     i2c.init(I2C.CONTROLLER)
///     i2c.send('123', 0x42)        # send 3 bytes to peripheral with address 0x42
///     i2c.send(b'456', addr=0x42)  # keyword for address
///
/// Master also has other methods:
///
///     i2c.is_ready(0x42)           # check if peripheral 0x42 is ready
///     i2c.scan()                   # scan for peripherals on the bus, returning
///                                  #   a list of valid addresses
///     i2c.mem_read(3, 0x42, 2)     # read 3 bytes from memory of peripheral 0x42,
///                                  #   starting at address 2 in the peripheral
///     i2c.mem_write('abc', 0x42, 2, timeout=1000)
#define PYB_I2C_MASTER (0)
#define PYB_I2C_SLAVE  (1)

#define PYB_I2C_SPEED_STANDARD (100000L)
#define PYB_I2C_SPEED_FULL     (400000L)
#define PYB_I2C_SPEED_FAST     (1000000L)

#if defined(MICROPY_HW_I2C1_SCL)
I2C_HandleTypeDef I2CHandle1 = {.Instance = NULL};
#endif
#if defined(MICROPY_HW_I2C2_SCL)
I2C_HandleTypeDef I2CHandle2 = {.Instance = NULL};
#endif
#if defined(MICROPY_HW_I2C3_SCL)
I2C_HandleTypeDef I2CHandle3 = {.Instance = NULL};
#endif
#if defined(MICROPY_HW_I2C4_SCL)
I2C_HandleTypeDef I2CHandle4 = {.Instance = NULL};
#endif

STATIC bool pyb_i2c_use_dma[4];

const pyb_i2c_obj_t pyb_i2c_obj[] = {
    #if defined(MICROPY_HW_I2C1_SCL)
    {{&pyb_i2c_type}, &I2CHandle1, &dma_I2C_1_TX, &dma_I2C_1_RX, &pyb_i2c_use_dma[0]},
    #else
    {{&pyb_i2c_type}, NULL, NULL, NULL, NULL},
    #endif
    #if defined(MICROPY_HW_I2C2_SCL)
    {{&pyb_i2c_type}, &I2CHandle2, &dma_I2C_2_TX, &dma_I2C_2_RX, &pyb_i2c_use_dma[1]},
    #else
    {{&pyb_i2c_type}, NULL, NULL, NULL, NULL},
    #endif
    #if defined(MICROPY_HW_I2C3_SCL)
    {{&pyb_i2c_type}, &I2CHandle3, &dma_I2C_3_TX, &dma_I2C_3_RX, &pyb_i2c_use_dma[2]},
    #else
    {{&pyb_i2c_type}, NULL, NULL, NULL, NULL},
    #endif
    #if defined(MICROPY_HW_I2C4_SCL)
    {{&pyb_i2c_type}, &I2CHandle4, &dma_I2C_4_TX, &dma_I2C_4_RX, &pyb_i2c_use_dma[3]},
    #else
    {{&pyb_i2c_type}, NULL, NULL, NULL, NULL},
    #endif
};

#if defined(STM32F7) || defined(STM32G0) || defined(STM32G4) || defined(STM32H7) || defined(STM32L4)

// The STM32F0, F3, F7, H7 and L4 use a TIMINGR register rather than ClockSpeed and
// DutyCycle.

#define PYB_I2C_TIMINGR (1)

#if defined(STM32F745xx) || defined(STM32F746xx) || defined(STM32F756xx)

// The value 0x40912732 was obtained from the DISCOVERY_I2Cx_TIMING constant
// defined in the STM32F7Cube file Drivers/BSP/STM32F746G-Discovery/stm32f7456g_discovery.h
#define MICROPY_HW_I2C_BAUDRATE_TIMING { \
        {PYB_I2C_SPEED_STANDARD, 0x40912732}, \
        {PYB_I2C_SPEED_FULL, 0x10911823}, \
        {PYB_I2C_SPEED_FAST, 0x00611116}, \
}
#define MICROPY_HW_I2C_BAUDRATE_DEFAULT (PYB_I2C_SPEED_FULL)
#define MICROPY_HW_I2C_BAUDRATE_MAX (PYB_I2C_SPEED_FAST)

#elif defined(STM32F722xx) || defined(STM32F723xx) \
    || defined(STM32F732xx) || defined(STM32F733xx) \
    || defined(STM32F765xx) || defined(STM32F767xx) \
    || defined(STM32F769xx)

// These timing values are for f_I2CCLK=54MHz and are only approximate
#define MICROPY_HW_I2C_BAUDRATE_TIMING { \
        {PYB_I2C_SPEED_STANDARD, 0xb0420f13}, \
        {PYB_I2C_SPEED_FULL, 0x70330309}, \
        {PYB_I2C_SPEED_FAST, 0x50100103}, \
}
#define MICROPY_HW_I2C_BAUDRATE_DEFAULT (PYB_I2C_SPEED_FULL)
#define MICROPY_HW_I2C_BAUDRATE_MAX (PYB_I2C_SPEED_FAST)

#elif defined(STM32G0)
// generated using CubeMX
#define MICROPY_HW_I2C_BAUDRATE_TIMING { \
        {PYB_I2C_SPEED_STANDARD, 0x10707DBC}, \
        {PYB_I2C_SPEED_FULL, 0x00602173}, \
        {PYB_I2C_SPEED_FAST, 0x00300B29}, \
}
#define MICROPY_HW_I2C_BAUDRATE_DEFAULT (PYB_I2C_SPEED_FULL)
#define MICROPY_HW_I2C_BAUDRATE_MAX (PYB_I2C_SPEED_FAST)

#elif defined(STM32G4)
// timing input depends on PLL
// for now: 170MHz sysclock, PCLK 10.625 MHz
// using PCLOCK
// generated using CubeMX
#if defined(STM32G431xx) || defined(STM32G441xx)
#define MICROPY_HW_I2C_BAUDRATE_TIMING { \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
}
#else
#define MICROPY_HW_I2C_BAUDRATE_TIMING { \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
        {PYB_I2C_SPEED_STANDARD, 0x30A0A7FB}, \
}
#endif
#define MICROPY_HW_I2C_BAUDRATE_DEFAULT (PYB_I2C_SPEED_STANDARD)
#define MICROPY_HW_I2C_BAUDRATE_MAX (PYB_I2C_SPEED_STANDARD)

